[{"title":"Free Prenatal Yoga","where":"ZOOM+Kids Discovery Center<br>4427 NE Fremont St","description":"Prenatal yoga is designed to ease the discomforts of pregnancy and help to prepare your body and mind for childbirth. Through the practice of yoga poses (asanas), breathing exercises (pranayama) and meditation (dhyai), you'll learn to increase flexibility, and build strength, balance, and a mind/body connection. Samara Davis received her 200 hour RYS from Yoga Bhoga in Portland and has been a licensed Doula since 2009. Join her every Wednesday from 6-7 PM for this free class!","link":"mailto:prime@zoomcare.com?subject=Love Your Gut with Mountain Mel's Teas - FRI Apr 22","day":"2016-04-06","start":"18:00","finish":"19:00","id":"3b8a1f80-ed2d-4758-a51f-f40ec0859aa3"},{"title":"The Secret to Super Spring Salads","where":"ZOOM+Prime<br>3218 NE Broadway St","description":"Think salads are boring? Think again. Join the healthy food experts from Pure Simple Juice for an empowering hour of next-level salad inspiration, using local ingredients to enrich your body with foods that heal for real. You'll sample delicious dressings, learn about the benefits of microgreens, taste a variety of different seasonal fruits and veggies, and walk away with new ways to think about hearty, healthy salads that go way beyond lettuce.","link":"mailto:prime@zoomcare.com?subject=The Secret to Super Spring Salads- FRI Apr 8","day":"2016-04-08","start":"12:00","finish":"13:00","id":"24d3e4a9-ec70-4b9e-bceb-821633a49c23"},{"title":"Body Rolling and Breath Workshop with Vicki Seabrook","where":"+Performance<br>945 NW Lovejoy St, Portland, OR 97209","description":"Stressed out? Your body doesn't have to be. Learn how to keep your whole body tension free as you rock and roll your entire body over Yamuna Method inflatable balls—improving posture, relieving back, neck, and shoulder pain, and releasing tightness and tension that keeps you from breathing fully. Using breath work and body rolling, you'll bring increased awareness to your breathing process, as well as learn to expand your breath as a powerful tool to help you relax. Join us for this free, one-hour workshop Sunday, April 10 and walk away feeling better than ever.","link":"mailto:performance@zoomcare.com?subject=Body Rolling and Breath Workshop with Vicki Seabrook -  Sun APR 10","day":"2016-04-10","start":"10:00","finish":"11:00","id":"4508ee02-7b2e-4079-bcf8-5a8a6059bc99"},{"title":"How to Adjust Your Bike Fit Like a Pro","where":"+Performance<br>945 NW Lovejoy St, Portland, OR 97209","description":"If riding your bike gives you knee pain, back pain, or is simply a pain in the butt, this free lunchtime class is for you. Join Kevin Schmidt, the founder of Portland’s bicycle-centric physical therapy practice Pedal PT, as he discusses common causes of pain on the bike and explains how your bike fit positioning can influence risk of injury. Learn about how your body adapts to riding, proper posture on the bike, and simple ways to remedy common cycling ailments—with plenty of chances to get your personal questions answered. Great for all levels of bicycling experience!","link":"mailto:performance@zoomcare.com?subject=How to Adjust Your Bike Fit Like a Pro -  Wed APR 13","day":"2016-04-13","start":"12:00","id":"df0a73b0-21f0-4544-87a7-23ebb713b931"},{"title":"Free Prenatal Yoga","where":"ZOOM+Kids Discovery Center<br>4427 NE Fremont St","description":"Prenatal yoga is designed to ease the discomforts of pregnancy and help to prepare your body and mind for childbirth. Through the practice of yoga poses (asanas), breathing exercises (pranayama) and meditation (dhyai), you'll learn to increase flexibility, and build strength, balance, and a mind/body connection. Samara Davis received her 200 hour RYS from Yoga Bhoga in Portland and has been a licensed Doula since 2009. Join her every Wednesday from 6-7 PM for this free class!","link":"mailto:prime@zoomcare.com?subject=Love Your Gut with Mountain Mel's Teas - FRI Apr 22","day":"2016-04-13","start":"18:00","finish":"19:00","id":"0c0313be-7b9f-4632-806e-c6222d07b542"},{"title":"The Portland Snack Symposium","where":"ZOOM+Performance<br>945 NW Lovejoy St","description":"There's only one thing Portlanders like more than food: free food. Join us for a farmers market-style exploration of some of the best healthy snacks around. This free for all event will feature delicious pre- and post-workout snack recipe demonstrations from Kyra's Bakeshop, Bee Local Honey, and Jacobsen Salt Co, as well as samples from local companies Jem Raw sprouted nut butters, Masala Pop gourmet popcorn, Eliot's Adult Nut Butters, Sisters Fruit Co. apple chips, Pure Simple Juice kale chips and raw cookies, Broth Bar by Salt, Fire & Time granola and jerky, Great Cedar hummus, and much more. Find your new favorite healthy snack and meet the people who make it. See you there!","link":"mailto:performance@zoomcare.com?subject=The Portland Snack Symposium- SUN Apr 17","day":"2016-04-17","start":"13:00","finish":"15:00","id":"83fd9dd0-8346-4c8b-8ae7-ee6d5c473acc"},{"title":"Love Your Gut with Mountain Mel's Teas","where":"ZOOM+Prime<br>3218 NE Broadway St","description":"Tummy troubles? Teas and herbs may help. Local tea company Mountain Mel's Essential Goods creates a line of medicinal quality herbal teas and herbal first aid goods. In this class, herbalist and Mountain Mel's founder Melissa Mutterspaugh will spotlight how beneficial herbs can help improve digestion and gut health. Sample Mountain Mel's \"Diges-Teas\" during the class, and get your herbal questions answered! Find out more at <a href=\"http://mountainmels.com/index.html\">Mountain Mel's</a>","link":"mailto:prime@zoomcare.com?subject=Love Your Gut with Mountain Mel's Teas - FRI Apr 22","day":"2016-04-22","start":"12:00","finish":"13:00","id":"a5c5f9d1-754b-4511-ba65-1cdce526db62"},{"title":"The Secrets to Strength Training without a Gym","where":"ZOOM+Performance<br>945 NW Lovejoy St","description":"Join Portland personal trainer Jeremy Hyatt for this free weekend class and learn the ins and outs of doing strength training with no equipment. Jeremy will share a complete full-body workout that can be adjusted to any level of fitness and in any space. You’ll learn simple, easy to implement exercises to do at home or while traveling, along with all the cues and coaching techniques to perform the exercises safely. Come sweat with us on a Sunday morning—parking in the Pearl District is free until 1pm!","link":"mailto:performance@zoomcare.com?subject=The Secrets to Strength Training without a Gym- SUN May 1","day":"2016-05-01","start":"10:00","finish":"11:00","id":"f3529b11-d2fb-4e98-8689-34d88a2bf0b2"}]
